INSERT OR REPLACE INTO firm
VALUES (1,"google"),
(2,"yandex"),
(3,"Ситилинк"),
(4,"Мвидео"),
(5,"DNS"),
(6,"Технопоинт"),
(7,"Эльдорадо");

INSERT OR REPLACE INTO storage
VALUES (1,"Г.Пермь, ул. Попова 16",2,1,100,2,5),
(2,"Г.Пермь, ул. Ленина 60",2,2,10,1,5),
(3,"Г.Пермь, ул. Революции 60/1",1,3,23,3,5),
(4,"Г.Пермь, ул. Попова 22",2,1,38,2,3),
(5,"Г.Пермь, ул. Юрша 86",1,3,37,1,3),
(6,"Г.Пермь, ул. Мира 100",1,1,50,1,3),
(7,"Г.Пермь, ул. Шоссе Космонавтов 162Б",2,1,150,2,6),
(8,"Г.Пермь, ул. Промышленная 107",1,1,200,3,6),
(9,"Г.Пермь, ул. Уральская 85",1,1,20,4,6),
(10,"Г.Пермь, ул. Куйбышева 85а",1,2,14,5,7);

INSERT OR REPLACE INTO Manual_selection_zone
VALUES (10,1,1,1),
(2,0,2,2),
(2,1,3,2),
(10,1,4,3),
(20,1,5,4),
(14,0,6,5),
(25,1,7,6),
(100,2,8,7),
(1,0,9,8),
(4,2,10,9);


INSERT OR REPLACE INTO Pallet
VALUES (1,1,0,1),
(2,2,0,3),
(3,1,0,4),
(4,1,0,5),
(5,1,0,7),
(6,1,0,8),
(7,1,0,8),
(8,1,0,10),
(9,1,0,10),
(10,1,1,0),
(11,2,3,0),
(12,1,3,0),
(13,2,1,0),
(14,2,1,0),
(15,1,8,0),
(16,1,8,0),
(17,1,8,0),
(18,1,9,0),
(19,1,9,0),
(20,1,10,0),
(21,1,10,0),
(22,1,10,0),
(23,1,10,0),
(24,1,10,0);



INSERT OR REPLACE INTO Model
VALUES (1,"Oklick HS-L380G","Игровая гарнитура"),
(2,"Ritmix RH-555M","Игровая гарнитура"),
(3,"Haier 50 Smart TV MX","Телевизоры"),
(4,"POCO F3 128GB NIGHT BLACK","Телефоны");



INSERT OR REPLACE INTO Transport_firm
VALUES (1,"Грузовое путешествие",2,'2022-01-13','2022-05-28','2024-05-28'),
(2,"ПЭК",36,'2021-06-03','2022-01-08','2032-01-08'),
(3,"Авторитет",5,'2019-09-06','2025-01-08','2029-09-08'),
(4,"Байкал Сервис",2,'2018-12-29','2020-08-03','2021-09-30'),
(5,"Энергия",101,'2021-01-01','2021-02-02','2023-03-03');


INSERT OR REPLACE INTO Obj_item
VALUES (1,"Г.Пермь, ул. Попова 16",'2022-01-03','2022-02-08',1,2,1),
(2,"Г.Пермь, ул. Ленина 60",'2022-02-01','2022-03-02',2,3,2),
(3,"Г.Пермь, ул. Попова 22",'2022-02-01','2022-02-06',2,4,3),
(4,"Г.Пермь, ул. Шоссе Космонавтов 162Б",'2022-02-01','2022-03-02',3,4,4),
(5,"Г.Пермь, ул. Попова 16",'2022-01-03','2022-02-08',4,2,1),
(6,"Г.Пермь, ул. Шоссе Космонавтов 162Б",'2022-01-03','2022-02-08',5,1,4),
(7,"Г.Пермь, ул. Попова 22",'2022-02-01','2022-02-06',6,2,2),
(8,"Г.Пермь, ул. Куйбышева 85а",'2022-03-01','2022-03-08',7,3,3),
(9,"Г.Пермь, ул. Ленина 60",'2022-03-01','2022-03-08',8,4,1),
(10,"Г.Пермь, ул. Куйбышева 85а",'2022-03-01','2022-03-08',9,2,1),
(11,"Г.Пермь, ул. Куйбышева 85а",'2022-02-01','2022-03-02',10,3,2),
(12,"Г.Пермь, ул. Попова 16",'2022-03-01','2022-03-08',11,1,4),
(13,"Г.Пермь, ул. Промышленная 107",'2022-03-01','2022-03-08',11,1,5),
(14,"Г.Пермь, ул. Попова 22",'2022-03-01','2022-03-08',12,3,1),
(15,"Г.Пермь, ул. Промышленная 107",'2022-03-01','2022-03-08',13,2,2),
(16,"Г.Пермь, ул. Ленина 60",'2022-01-03','2022-02-08',13,1,5),
(17,"Г.Пермь, ул. Попова 22",'2022-02-01','2022-02-06',14,1,2),
(18,"Г.Пермь, ул. Промышленная 107",'2022-02-01','2022-02-06',14,2,4),
(19,"Г.Пермь, ул. Ленина 60",'2022-03-01','2022-03-08',15,3,4),
(20,"Г.Пермь, ул. Куйбышева 85а",'2022-03-01','2022-03-08',16,3,4),
(21,"Г.Пермь, ул. Попова 16",'2022-01-03','2022-02-08',17,4,4),
(22,"Г.Пермь, ул. Попова 22",'2022-02-01','2022-02-06',18,3,2),
(23,"Г.Пермь, ул. Ленина 60",'2022-02-01','2022-02-06',19,4,1),
(24,"Г.Пермь, ул. Шоссе Космонавтов 162Б",'2022-03-01','2022-03-08',20,2,5),
(25,"Г.Пермь, ул. Попова 16",'2022-02-01','2022-02-06',21,1,1),
(26,"Г.Пермь, ул. Попова 22",'2022-02-01','2022-03-02',22,2,3),
(27,"Г.Пермь, ул. Шоссе Космонавтов 162Б",'2022-02-01','2022-02-06',23,2,3),
(28,"Г.Пермь, ул. Попова 22",'2022-02-01','2022-03-02',24,1,2);





